//ENUMALOC JOB CLASS=A,MSGCLASS=Y,NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//* New installations only. All datasets must be absent.
//ALLOC    EXEC PGM=IEFBR14
//LOADLIB  DD DSN=&SYSUID..ENUM.LOADLIB,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSALLDA,
//            SPACE=(CYL,(10,5,30)),DSNTYPE=PDS,
//            DCB=(RECFM=U,LRECL=0,BLKSIZE=32760)
//SOURCE   DD DSN=&SYSUID..ENUM.SOURCE,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSALLDA,
//            SPACE=(CYL,(10,5,30)),DSNTYPE=PDS,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)
//REXXLIB  DD DSN=&SYSUID..ENUM.REXXLIB,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSALLDA,
//            SPACE=(CYL,(10,5,30)),DSNTYPE=PDS,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)
//JCLLIB   DD DSN=&SYSUID..ENUM.JCLLIB,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSALLDA,
//            SPACE=(CYL,(10,5,30)),DSNTYPE=PDS,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)
//XMILIB   DD DSN=&SYSUID..ENUM.XMILIB,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSALLDA,
//            SPACE=(CYL,(10,5,30)),DSNTYPE=PDS,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//UNIXTAR  DD DSN=&SYSUID..ENUM.UNIXTAR,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSALLDA,
//            SPACE=(CYL,(10,5)),
//            DCB=(DSORG=PS,RECFM=U,LRECL=0,BLKSIZE=6144)
