//ENAPFC JOB CLASS=A,MSGCLASS=Y,NOTIFY=&SYSUID,MSGLEVEL=(1,1),
//         REGION=0M
//* Assemble and link APFCHECK. Requires &SYSUID..ENUM.SOURCE
//* and &SYSUID..ENUM.LOADLIB.
//ASSEMBLY EXEC PGM=ASMA90,PARM='OBJECT,NODECK,XREF(SHORT)'
//SYSPRINT DD  SYSOUT=*
//SYSTERM  DD  SYSOUT=*
//SYSIN    DD  DSN=&SYSUID..ENUM.SOURCE(APFCHECK),DISP=SHR
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.MODGEN,DISP=SHR
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,(2,2))
//SYSLIN   DD  DSN=&&OBJ,DISP=(NEW,PASS),
//             UNIT=SYSALLDA,SPACE=(CYL,(1,1)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//LINK     EXEC PGM=HEWL,PARM='MAP,LIST,NCAL,AC=0',
//             COND=(0,NE,ASSEMBLY)
//SYSLIN   DD  DSN=&&OBJ,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=&SYSUID..ENUM.LOADLIB(APFCHECK),DISP=SHR
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 NAME APFCHECK(R)
/*
