//ENUMPACK JOB CLASS=A,MSGCLASS=Y,NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//LOADLIB  EXEC PGM=IKJEFT1B,DYNAMNBR=30,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//XMITOUT  DD DSN=&SYSUID..ENUM.XMILIB(LOADLIB),DISP=SHR,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//SYSTSIN  DD *,SYMBOLS=EXECSYS
 XMIT LOCAL.&SYSUID DATASET('&SYSUID..ENUM.LOADLIB') -
   OUTDDNAME(XMITOUT) NONOTIFY NOLOG
/*
//JCLLIB   EXEC PGM=IKJEFT1B,DYNAMNBR=30,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//XMITOUT  DD DSN=&SYSUID..ENUM.XMILIB(JCLLIB),DISP=SHR,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//SYSTSIN  DD *,SYMBOLS=EXECSYS
 XMIT LOCAL.&SYSUID DATASET('&SYSUID..ENUM.JCLLIB') -
   OUTDDNAME(XMITOUT) NONOTIFY NOLOG
/*
//SOURCE   EXEC PGM=IKJEFT1B,DYNAMNBR=30,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//XMITOUT  DD DSN=&SYSUID..ENUM.XMILIB(SOURCE),DISP=SHR,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//SYSTSIN  DD *,SYMBOLS=EXECSYS
 XMIT LOCAL.&SYSUID DATASET('&SYSUID..ENUM.SOURCE') -
   OUTDDNAME(XMITOUT) NONOTIFY NOLOG
/*
//REXXLIB  EXEC PGM=IKJEFT1B,DYNAMNBR=30,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//XMITOUT  DD DSN=&SYSUID..ENUM.XMILIB(REXXLIB),DISP=SHR,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//SYSTSIN  DD *,SYMBOLS=EXECSYS
 XMIT LOCAL.&SYSUID DATASET('&SYSUID..ENUM.REXXLIB') -
   OUTDDNAME(XMITOUT) NONOTIFY NOLOG
/*
//UNIXTAR  EXEC PGM=IKJEFT1B,DYNAMNBR=30,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//XMITOUT  DD DSN=&SYSUID..ENUM.XMILIB(UNIXTAR),DISP=SHR,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//SYSTSIN  DD *,SYMBOLS=EXECSYS
 XMIT LOCAL.&SYSUID DATASET('&SYSUID..ENUM.UNIXTAR') -
   OUTDDNAME(XMITOUT) NONOTIFY NOLOG
/*
//OUTER    EXEC PGM=IKJEFT1B,DYNAMNBR=30,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//XMITOUT  DD DSN=&SYSUID..ENUM.XMI,DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSALLDA,SPACE=(CYL,(20,5),RLSE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)
//SYSTSIN  DD *,SYMBOLS=EXECSYS
 XMIT LOCAL.&SYSUID DATASET('&SYSUID..ENUM.XMILIB') -
   OUTDDNAME(XMITOUT) NONOTIFY NOLOG
/*
