//ENUMRUN JOB CLASS=A,MSGCLASS=Y,NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//* Change ALL to HELP, SEC, APF, AUTH, ASSESS, or another ENUM option.
//ENUM     EXEC PGM=IKJEFT1B,DYNAMNBR=50,REGION=0M
//STEPLIB  DD DSN=&SYSUID..ENUM.LOADLIB,DISP=SHR
//SYSEXEC  DD DSN=&SYSUID..ENUM.REXXLIB,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *,SYMBOLS=EXECSYS
 EX '&SYSUID..ENUM.REXXLIB(ENUM)' 'ALL'
/*
