//APFRUN JOB CLASS=A,MSGCLASS=Y,NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//APFCHECK EXEC PGM=APFCHECK,REGION=0M
//STEPLIB  DD DSN=&SYSUID..ENUM.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
